FIELD_NAME = "姓名"
FIELD_COMMIT_STATE = "提交状态"
FIELD_WORK_COMPLETION = "作业完成率%"
FIELD_UID = "学员id"
FIELD_OBJECTIVE_SCORE = "客观题得分"
FIELD_SUBJECTIVE_SCORE = "主观题得分"
FIELD_SCORE = "得分"
FIELD_REAL_NAME = "真实姓名"
FIELD_INDEX = "序号"
MENU_MAIN = """
***********************
按1，选定作业表,统计提交率(多选)
按2，选定成绩单,提取考试成绩
按3，选定目标表,批量删除学员
按4，图片转为excel文件
按0，退出程序
***********************"""
MENU_DELETE = """
*************************************
按1，"目标"将删除"参考"中存在的学员
按2，"目标"将保留"参考"中存在的学员其余删除
*************************************"""
MENU_SRC = """
*****************************
指定"参考"表(多选)，按Enter键继续
*****************************"""
# MENU_DST = """
# **********************************
# 指定要批量删除的"目标"表，按Enter键继续
# **********************************"""
MENU_OUTPUT = """
******************************
按1，将结果导出到一个指定的表格中
按2，将结果导出到新的文件中
******************************"""
# MENU_SCORE = """
# **********************
# 选取成绩单表,按Enter继续
# **********************"""
# MENU_WORK = """
# ***********************************
# 选取进行统计的作业表(多选),按Enter继续
# ***********************************"""

