# FIELD_NAME = "姓名"
# FIELD_COMMIT_STATE = "提交状态"
# FIELD_WORK_COMPLETION = "作业完成率%"
# FIELD_UID = "学员id"
# FIELD_OBJECTIVE_SCORE = "客观题得分"
# FIELD_SUBJECTIVE_SCORE = "主观题得分"
# FIELD_SCORE = "得分"
# FIELD_REAL_NAME = "真实姓名"
# FIELD_INDEX = "序号"
# MENU_MAIN_bak = """
# ****************************
# 按1，选定作业表,统计提交率(多选)
# 按2，选定成绩单,提取考试成绩
# 按3，选定目标表,批量删除学员
# 按4，图片转为excel文件
# 按5，合并成绩单(多选)
# 按0，退出程序
# ****************************"""
MENU_MAIN = """
************************************
按1，统计"作业率"及"得分"
按2，批量删除学员
按3，表格照片转为excel文件
按0，退出程序
***********************************"""

ENTER_CONTINUE = "*准备就绪后,点enter键继续..."
MENU_MODIFY = f"""
****************************************
*"小鹅通"导出的作业放在->作业<-文件夹
*"小鹅通"导出的成绩单放在->考试<-文件夹
*要添加"作业率"和"得分"的excel与本程序同文件夹
*确保"作业"和"考试"文件夹没有上次使用的数据残留
{ENTER_CONTINUE}
****************************************
"""
MENU_OCR = f"""
****************************************
*将需要转换的图片放在->图片<-文件夹中
{ENTER_CONTINUE}
****************************************
"""
MENU_DELETE = f"""
*************************************
*将要删除的学员的excel放在"删除"文件夹
*excel中至少要有"姓名"列
{ENTER_CONTINUE}
*************************************"""
# MENU_SRC = """
# ******************************
# 指定"参考"表(多选)，按Enter键继续
# ******************************"""
# MENU_OUTPUT = """
# *****************************
# 按1，将结果导出到一个指定的表格中
# 按2，将结果导出到新的文件中
# *****************************"""
# MENU_SCORE = """
# **********************
# 选取成绩单表,按Enter继续
# **********************"""
# MENU_WORK = """
# ***********************************
# 选取进行统计的作业表(多选),按Enter继续
# ***********************************"""
# MENU_DST = """
# **********************************
# 指定要批量删除的"目标"表，按Enter键继续
# **********************************"""
